; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	satellite4 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite5 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	satellite6 - satellite
	instrument10 - instrument
	instrument11 - instrument
	satellite7 - satellite
	instrument12 - instrument
	instrument13 - instrument
	image0 - mode
	infrared1 - mode
	Star2 - direction
	GroundStation5 - direction
	Star1 - direction
	Star0 - direction
	Star4 - direction
	Star3 - direction
	Phenomenon6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Planet10 - direction
)
(:init
	(supports instrument0 infrared1)
	(calibration_target instrument0 Star1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star2)
	(supports instrument1 infrared1)
	(calibration_target instrument1 GroundStation5)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation5)
	(supports instrument2 infrared1)
	(calibration_target instrument2 Star1)
	(calibration_target instrument2 Star0)
	(supports instrument3 infrared1)
	(calibration_target instrument3 Star4)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star9)
	(supports instrument4 image0)
	(supports instrument4 infrared1)
	(calibration_target instrument4 Star3)
	(calibration_target instrument4 Star2)
	(on_board instrument4 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon6)
	(supports instrument5 image0)
	(supports instrument5 infrared1)
	(calibration_target instrument5 GroundStation5)
	(supports instrument6 infrared1)
	(supports instrument6 image0)
	(calibration_target instrument6 Star2)
	(on_board instrument5 satellite4)
	(on_board instrument6 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star1)
	(supports instrument7 infrared1)
	(supports instrument7 image0)
	(calibration_target instrument7 Star0)
	(calibration_target instrument7 Star4)
	(supports instrument8 infrared1)
	(supports instrument8 image0)
	(calibration_target instrument8 Star3)
	(supports instrument9 infrared1)
	(calibration_target instrument9 Star1)
	(calibration_target instrument9 GroundStation5)
	(on_board instrument7 satellite5)
	(on_board instrument8 satellite5)
	(on_board instrument9 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Star1)
	(supports instrument10 infrared1)
	(calibration_target instrument10 Star3)
	(supports instrument11 infrared1)
	(calibration_target instrument11 Star0)
	(calibration_target instrument11 Star1)
	(on_board instrument10 satellite6)
	(on_board instrument11 satellite6)
	(power_avail satellite6)
	(pointing satellite6 Star1)
	(supports instrument12 infrared1)
	(calibration_target instrument12 Star4)
	(calibration_target instrument12 Star0)
	(supports instrument13 image0)
	(calibration_target instrument13 Star3)
	(on_board instrument12 satellite7)
	(on_board instrument13 satellite7)
	(power_avail satellite7)
	(pointing satellite7 Phenomenon8)
)
(:goal (and
	(pointing satellite0 Star3)
	(pointing satellite1 Star2)
	(pointing satellite2 Star2)
	(pointing satellite6 Star4)
	(pointing satellite7 Planet10)
	(have_image Phenomenon6 image0)
	(have_image Star7 image0)
	(have_image Phenomenon8 image0)
	(have_image Star9 infrared1)
	(have_image Planet10 image0)
))

)

; plan
1. (turn_to satellite6 star4 star1)
   deleted: (pointing satellite6 star1)
   added: (pointing satellite6 star4)
   goals met: 1 of 10
2. (turn_to satellite3 star2 phenomenon6)
   deleted: (pointing satellite3 phenomenon6)
   added: (pointing satellite3 star2)
   goals met: 1 of 10
3. (switch_on instrument4 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument4)
   goals met: 1 of 10
4. (calibrate satellite3 instrument4 star2)
   added: (calibrated instrument4)
   goals met: 1 of 10
5. (turn_to satellite3 phenomenon6 star2)
   deleted: (pointing satellite3 star2)
   added: (pointing satellite3 phenomenon6)
   goals met: 1 of 10
6. (turn_to satellite2 star2 star9)
   deleted: (pointing satellite2 star9)
   added: (pointing satellite2 star2)
   goals met: 2 of 10
7. (turn_to satellite1 star2 groundstation5)
   deleted: (pointing satellite1 groundstation5)
   added: (pointing satellite1 star2)
   goals met: 3 of 10
8. (turn_to satellite0 star3 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star3)
   goals met: 4 of 10
9. (take_image satellite3 phenomenon6 instrument4 image0)
   added: (have_image phenomenon6 image0)
   goals met: 5 of 10
10. (turn_to satellite3 phenomenon8 phenomenon6)
   deleted: (pointing satellite3 phenomenon6)
   added: (pointing satellite3 phenomenon8)
   goals met: 5 of 10
11. (take_image satellite3 phenomenon8 instrument4 image0)
   added: (have_image phenomenon8 image0)
   goals met: 6 of 10
12. (turn_to satellite3 planet10 phenomenon8)
   deleted: (pointing satellite3 phenomenon8)
   added: (pointing satellite3 planet10)
   goals met: 6 of 10
13. (take_image satellite3 planet10 instrument4 image0)
   added: (have_image planet10 image0)
   goals met: 7 of 10
14. (turn_to satellite3 star7 planet10)
   deleted: (pointing satellite3 planet10)
   added: (pointing satellite3 star7)
   goals met: 7 of 10
15. (take_image satellite3 star7 instrument4 image0)
   added: (have_image star7 image0)
   goals met: 8 of 10
16. (turn_to satellite3 star9 star7)
   deleted: (pointing satellite3 star7)
   added: (pointing satellite3 star9)
   goals met: 8 of 10
17. (take_image satellite3 star9 instrument4 infrared1)
   added: (have_image star9 infrared1)
   goals met: 9 of 10
18. (turn_to satellite7 planet10 phenomenon8)
   deleted: (pointing satellite7 phenomenon8)
   added: (pointing satellite7 planet10)
   goals met: 10 of 10
